Documents/ВозвратПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВозвратПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.ПлатежныйКалендарьЗакупки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_АвтоматическийПоиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратПоставщику/Ext/ManagerModule.bsl
Процедура ЗаполнитьРеквизиты(Форма) Экспорт
	Форма.ИмяЖурнала = "Возвраты поставщикам";
КонецПроцедуры

Процедура УстановитьВсеПараметры(Форма) Экспорт
КонецПроцедуры

Процедура ПечатьДокумента(Тек, Поз, Таб, Параметры = 0) Экспорт
	Таб.Очистить();
	
	М = Документы.ВозвратПоставщику.ПолучитьМакет("Печать");
	С = Новый Структура;
	гоВставитьКучу(С, "Загол, ИмяПокупателя1, ИмяПокупателя2, ИмяПокупателя3, ИмяПоставщика1, ИмяПоставщика2, ИмяПоставщика3, ИмяПоставщика4, ИмяПоставщика5, ИмяПоставщика6");
	гоВставитьКучу(С, "ИмяСклада, ДопНомера, НомерПП, лНоменклатура, лЕИ, лКоличество, лЦена, лСумма, сКоличество, сБезНДС, сНДС, сСумма, ссСкидка, сСкидка, СтрСНДС");
	гоВставитьКучу(С, "лБезНДС, лНДС, лСкидка, лВалюта, сВалюта, лОплата");
	
	С.Загол = "Возврат поставщику № " + Тек.Номер + " от " + гоДата(Тек.Дата);
	С.ИмяСклада = СокрЛП(Тек.Склад);
	С.ИмяПоставщика1 = "";
	С.ИмяПоставщика2 = "";
	С.ИмяПоставщика3 = "";
	С.ИмяПоставщика4 = "";
	С.ИмяПоставщика5 = "";
	С.ИмяПоставщика6 = "";
	С.ИмяПокупателя1 = "";
	С.ИмяПокупателя2 = "";
	С.ИмяПокупателя3 = "";

	Если гоНПЗ(Тек.Фирма) Тогда
		С.ИмяПокупателя1 = СокрЛП(Тек.Фирма.ПолнНаименование);
	КонецЕсли;
	
	Если гоНПЗ(Тек.Контрагент) Тогда
		С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.ПолнНаименование);
		Если С.ИмяПоставщика1 = "" Тогда С.ИмяПоставщика1 = СокрЛП(Тек.Контрагент.Наименование) КонецЕсли;
	КонецЕсли;
	
	Фикс = 4;
	глВывестиСекцию(Таб, М, "ШапкаП1", С); гоПлюс(Фикс);
	Если С.ИмяПоставщика2 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика3 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП3", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика4 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП4", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика5 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП5", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПоставщика6 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаП6", С); гоПлюс(Фикс); КонецЕсли;
	глВывестиСекцию(Таб, М, "ШапкаК1", С); гоПлюс(Фикс);
	Если С.ИмяПокупателя2 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаК2", С); гоПлюс(Фикс); КонецЕсли;
	Если С.ИмяПокупателя3 <> "" Тогда глВывестиСекцию(Таб, М, "ШапкаК3", С); гоПлюс(Фикс); КонецЕсли;
	
	глВывестиСекцию(Таб, М, "Шапка", С);
	
	Табл = Тек.Товары.Выгрузить();
	Табл.Свернуть("Номенклатура, ЦенаЗакупки", "Количество, СуммаЗакупки");
	
	С.лВалюта = СокрЛП(Тек.Валюта);
	
	ЧислоЗнаковЦена = Тек.Фирма.ЧислоЗнаковЦенаЗакупки;
	
	НомерПП = 0;
	Для Каждого _Табл Из Табл Цикл
		гоПлюс(НомерПП);
		
		С.лНоменклатура = гоИмя(_Табл.Номенклатура, Ложь);
		С.НомерПП = НомерПП;
		С.лЕИ = "шт.";	//СокрЛП(_Табл.Номенклатура.ЕИ);
		С.лКоличество = _Табл.Количество;
		
		С.лЦена = гоСуммаЗн(_Табл.ЦенаЗакупки, ЧислоЗнаковЦена);
		С.лСумма = гоЦена2(_Табл.СуммаЗакупки);
		
		глВывестиСекцию(Таб, М, "Строка", С);
	КонецЦикла;
	
	С.сКоличество = Табл.Итог("Количество");
	С.сВалюта = С.лВалюта;
	
	лСумПро = Тек.Сумма;
	чСумма = 0;
	чСумма = лСумПро;
	С.сСумма = гоЦена2(чСумма);
	С.сБезНДС = гоЦена2(чСумма);
	С.сНДС = гоЦена2(0);
	С.СтрСНДС = гоСуммаПрописьюВал(чСумма, Тек.Валюта);	// + гоРС() + "Без НДС.";
		
	глВывестиСекцию(Таб, М, "Подвал", С);
	
	глПараметрыСтраницы(Таб, 1);
	глПовторятьПриПечатиСтроки(Таб, Фикс, Фикс);
КонецПроцедуры
